iceant/LightRTOS/Application/UB_N32G457_MiniOfflineV1/board.h
#ifndef INCLUDED_BOARD_H
#define INCLUDED_BOARD_H

////////////////////////////////////////////////////////////////////////////////
////
#ifndef INCLUDED_N_32_G_45_X_H
#define INCLUDED_N_32_G_45_X_H
#include <n32g45x.h>
#endif /* INCLUDED_N_32_G_45_X_H */

#ifndef INCLUDED_STDINT_H
#define INCLUDED_STDINT_H
#include <stdint.h>
#endif /* INCLUDED_STDINT_H */

#ifndef INCLUDED_STDDEF_H
#define INCLUDED_STDDEF_H
#include <stddef.h>
#endif /* INCLUDED_STDDEF_H */

#ifndef INCLUDED_DS1307_H
#include <DS1307.h>
#endif /*INCLUDED_DS1307_H*/

#ifndef INCLUDED_BSP_USART1_H
#include <bsp_usart1.h>
#endif /*INCLUDED_BSP_USART1_H*/

#ifndef INCLUDED_BSP_UART5_H
#include <bsp_uart5.h>
#endif /*INCLUDED_BSP_UART5_H*/

#ifndef INCLUDED_BSP_UART7_H
#include <bsp_uart7.h>
#endif /*INCLUDED_BSP_UART7_H*/

#ifndef INCLUDED_A7670C_H
#include <A7670C.h>
#endif /*INCLUDED_A7670C_H*/

#ifndef INCLUDED_BSP_POWER3V3_H
#include <bsp_power3v3.h>
#endif /*INCLUDED_BSP_POWER3V3_H*/

#ifndef INCLUDED_SPI_FLASH_H
#include <spi_flash.h>
#endif /*INCLUDED_SPI_FLASH_H*/

#ifndef INCLUDED_BSP_TIM2_H
#include <bsp_tim2.h>
#endif /*INCLUDED_BSP_TIM2_H*/

#ifndef INCLUDED_BSP_CPUID_H
#include <bsp_cpuid.h>
#endif /*INCLUDED_BSP_CPUID_H*/

#ifndef INCLUDED_IM1253E_H
#include <IM1253E.h>
#endif /*INCLUDED_IM1253E_H*/

////////////////////////////////////////////////////////////////////////////////
////
void board_init(void);

#endif /* INCLUDED_BOARD_H */
